// =====================================================
// FILE: src/Config.h
// =====================================================

// ============================================
// НАСТРОЙКА ТЕСТИРУЕМЫХ МОДУЛЕЙ
// ============================================
//#define TEST_GPS          // Раскомментировать для тестирования GPS модуля
#define GPS_MOCK_MODE 2   //  1 - REAL GPS OUTPUT, 2 - MOCK PARSER, 3 - LONG GPS OUTPUTS,
//#define TEST_SIM800L        // Раскомментировать для тестирования SIM800L модуля
#define TEST_MPU6050       // Раскомментировать для тестирования MPU6050 датчика

// ============================================
// ВЫБОР РЕЖИМА РАБОТЫ (РАСКОММЕНТИРОВАТЬ НУЖНЫЙ)
// ============================================
// ВАЖНО: Только ОДИН из следующих макросов должен быть раскомментирован!
// ============================================
#define MODE_DEBUG        // Режим отладки (активен по умолчанию)
                          
//#define MODE_TRACKER      // Режим трекера (GPS->SIM циклично)

//#define MODE_SLEEP        // Режим сна (пробуждение от MPU)

// ============================================
// НАСТРОЙКИ GSM
// ============================================
#define GSM_PHONE_NUMBER "+79991234567"  // Номер для отправки SMS

// ============================================
// НАСТРОЙКИ АКСЕЛЕРОМЕТРА
// ============================================
#define ACCELEROMETER_THRESHOLD 15000    // Порог движения